const Footer = () => {
    return (
        <>
            <footer className="footer">
                <div className="footer-container">
                    <div className="footer-logo">
                        <h3>Zokong</h3>
                        <p>Giày thể thao chất lượng cao</p>
                        <div className="contact">
                            <svg width="12" height="24" viewBox="0 0 12 24" fill="none" xmlns="http://www.w3.org/2000/svg" >
                                <path d="M10.6189 11.9769H7.33708V24H2.36482V11.9769H0V7.75149H2.36482V5.01717C2.36482 3.06184 3.29364 0 7.38134 0L11.0645 0.0154092V4.11688H8.39211C7.95377 4.11688 7.3374 4.33589 7.3374 5.26864V7.75542H11.0533L10.6189 11.9769Z" fill="#4267B2" />
                            </svg>

                            <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0.506448 11.0134C0.300838 5.59992 5.04257 0.597198 10.4615 0.532293C13.2234 0.296726 15.9104 1.36926 18.0005 3.11853C17.1431 4.06125 16.2708 4.99307 15.339 5.86544C13.4989 4.74752 11.2835 3.89558 9.13299 4.65221C5.6644 5.63986 3.56382 9.73526 4.8474 13.1285C5.9104 16.6724 10.2209 18.6173 13.5992 17.1286C15.3485 16.5022 16.5018 14.8882 17.0079 13.1539C15.0031 13.114 12.9978 13.1389 10.993 13.0836C10.988 11.8908 10.983 10.7025 10.988 9.50968C14.3313 9.50469 17.6796 9.49471 21.028 9.52466C21.2336 12.4472 20.8024 15.5749 18.9024 17.9206C16.3007 21.2689 11.4941 22.2516 7.58388 20.9381C3.43401 19.575 0.416125 15.3943 0.506448 11.0134Z" fill="#EA4335" />
                            </svg>
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48" width="30px" height="48px"><radialGradient id="yOrnnhliCrdS2gy~4tD8ma" cx="19.38" cy="42.035" r="44.899" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#fd5" /><stop offset=".328" stop-color="#ff543f" /><stop offset=".348" stop-color="#fc5245" /><stop offset=".504" stop-color="#e64771" /><stop offset=".643" stop-color="#d53e91" /><stop offset=".761" stop-color="#cc39a4" /><stop offset=".841" stop-color="#c837ab" /></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8ma)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z" /><radialGradient id="yOrnnhliCrdS2gy~4tD8mb" cx="11.786" cy="5.54" r="29.813" gradientTransform="matrix(1 0 0 .6663 0 1.849)" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#4168c9" /><stop offset=".999" stop-color="#4168c9" stop-opacity="0" /></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8mb)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z" /><path fill="#fff" d="M24,31c-3.859,0-7-3.14-7-7s3.141-7,7-7s7,3.14,7,7S27.859,31,24,31z M24,19c-2.757,0-5,2.243-5,5	s2.243,5,5,5s5-2.243,5-5S26.757,19,24,19z" /><circle cx="31.5" cy="16.5" r="1.5" fill="#fff" />
                                <path fill="#fff" d="M30,37H18c-3.859,0-7-3.14-7-7V18c0-3.86,3.141-7,7-7h12c3.859,0,7,3.14,7,7v12	C37,33.86,33.859,37,30,37z M18,13c-2.757,0-5,2.243-5,5v12c0,2.757,2.243,5,5,5h12c2.757,0,5-2.243,5-5V18c0-2.757-2.243-5-5-5H18z" /></svg>

                            <svg className="messap" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 48 48" width="30px" height="48px"><circle cx="24" cy="24" r="20" fill="#E60023" /><path fill="#FFF" d="M24.4439087,11.4161377c-8.6323242,0-13.2153931,5.7946167-13.2153931,12.1030884	c0,2.9338379,1.5615234,6.5853882,4.0599976,7.7484131c0.378418,0.1762085,0.581543,0.1000366,0.668457-0.2669067	c0.0668945-0.2784424,0.4038086-1.6369019,0.5553589-2.2684326c0.0484619-0.2015381,0.0246582-0.3746338-0.1384277-0.5731201	c-0.8269653-1.0030518-1.4884644-2.8461304-1.4884644-4.5645752c0-4.4115601,3.3399658-8.6799927,9.0299683-8.6799927	c4.9130859,0,8.3530884,3.3484497,8.3530884,8.1369019c0,5.4099731-2.7322998,9.1584473-6.2869263,9.1584473	c-1.9630737,0-3.4330444-1.6238403-2.9615479-3.6153564c0.5654297-2.3769531,1.6569214-4.9415283,1.6569214-6.6584473	c0-1.5354004-0.8230591-2.8169556-2.5299683-2.8169556c-2.006958,0-3.6184692,2.0753784-3.6184692,4.8569336	c0,1.7700195,0.5984497,2.9684448,0.5984497,2.9684448s-1.9822998,8.3815308-2.3453979,9.9415283	c-0.4019775,1.72229-0.2453003,4.1416016-0.0713501,5.7233887l0,0c0.4511108,0.1768799,0.9024048,0.3537598,1.3687744,0.4981079l0,0	c0.8168945-1.3278198,2.0349731-3.5056763,2.4864502-5.2422485c0.2438354-0.9361572,1.2468872-4.7546387,1.2468872-4.7546387	c0.6515503,1.2438965,2.5561523,2.296936,4.5831299,2.296936c6.0314941,0,10.378418-5.546936,10.378418-12.4400024	C36.7738647,16.3591919,31.3823242,11.4161377,24.4439087,11.4161377z" /></svg>

                            <svg width="24" height="17" viewBox="0 0 24 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.7747 3.37619C22.5154 2.41228 21.7554 1.65244 20.7916 1.39288C19.0309 0.911133 11.988 0.911133 11.988 0.911133C11.988 0.911133 4.94536 0.911133 3.18466 1.37462C2.23943 1.6339 1.46091 2.41241 1.20163 3.37619C0.738281 5.13675 0.738281 8.78792 0.738281 8.78792C0.738281 8.78792 0.738281 12.4575 1.20163 14.1996C1.46118 15.1634 2.22089 15.9233 3.1848 16.1828C4.9639 16.6647 11.9883 16.6647 11.9883 16.6647C11.9883 16.6647 19.0309 16.6647 20.7916 16.2012C21.7555 15.9418 22.5154 15.182 22.7749 14.2182C23.2381 12.4575 23.2381 8.80646 23.2381 8.80646C23.2381 8.80646 23.2567 5.13675 22.7747 3.37619V3.37619ZM9.7457 12.161V5.41484L15.6022 8.78792L9.7457 12.161Z" fill="#FF0000" />
                            </svg>
                        </div>
                    </div>
                    <div className="spa-container"> {/* New container for .spa */}
                        <div className="spa">
                            <a href="#">HOTLINE: 0846868623</a>
                        </div>
                    </div>
                    <div className="left-center-ft item-center-ft">
                        <p className="title-footer">Giới thiệu</p>
                        <ul className="messul">
                            <li>Về zokong</li>
                            <li>Tuyển dụng</li>
                            <li>Hệ thống cửa hàng</li>
                        </ul>
                    </div>
                    <div className="main-center-ft item-center-ft">
                        <p className="title-footer">Dịch vụ khánh hàng</p>
                        <ul>
                            <li>Chính sách điều khoản</li>
                            <li>Chính sách thanh toán</li>
                            <li>Chính sách nhận vận chuyển</li>
                            <li>Chính sách thẻ thanh toán</li>
                            <li>Chính sách bảo hành</li>
                        </ul>
                    </div>
                    <div className="right-center-ft item-center-ft">
                        <p className="title-footer">Liên hệ</p>
                        <ul>
                            <li>Hotline</li>
                            <li>Email</li>
                            <li>Live Chat</li>
                        </ul>
                    </div>

                    <div className="social-media">
                        <a href="#" className="social-icon"><i className="fab fa-facebook-f"></i></a>
                        <a href="#" className="social-icon"><i className="fab fa-instagram"></i></a>
                        <a href="#" className="social-icon"><i className="fab fa-twitter"></i></a>
                    </div>
                </div>
                <div className="footer-bottom">
                    <hr />
                    <p>&copy; 2024 Zokong. All rights reserved.</p>
                </div>
            </footer>
        </>
    );
};

export default Footer;
